tap "homebrew/bundle"
tap "takaishi/fomulas"
tap "kayac/tap"
tap "lucagrulla/tap"

brew "zsh"
brew "zsh-history-substring-search"
brew "tmux"
brew "fzf"
brew "rust"
brew "direnv"
brew "zoxide"
brew "gh"
brew "jq"
brew "ghq"
brew "tig"
brew "awscli"
brew "mas"
brew "marp-cli"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "ffmpeg"
brew "takaishi/tap/ced"
brew "gnupg"
brew "pinentry-mac"
brew "hugo"
brew "tfenv"
brew "postgresql"
brew "kayac/tap/ecspresso"
brew "cw"
brew "envchain"
brew "stern"
brew "watch"
brew "oven-sh/bun/bun"
brew "qmk/qmk/qmk"
brew "fujiwara/tap/lambroll"


# Rails, Dreamkast
brew "openssl@1.1"
brew "rbenv"
brew "ruby-build"
brew "mysql"
brew "glib"
brew "vips"
brew "nodenv"

# other
brew "go"



cask "visual-studio-code"
cask "1password-cli"
cask "gpg-suite"
cask "discord"
cask "zoom"
cask "obsidian"
cask "session-manager-plugin"


