cask_args appdir: "/Applications"


tap "1password/tap"
tap "aws/tap"
tap "buildpacks/tap"
tap "fujiwara/tap"
tap "goreleaser/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "k1loW/tap"
tap "knqyf263/utern"
tap "koekeishiya/formulae"
tap "mrtc0/openv"
tap "ngrok/ngrok"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "sachaos/todoist"
tap "takaishi/fomulas"
tap "homebrew/cask-fonts"
brew "brotli"
brew "giflib"
brew "imath"
brew "jpeg"
brew "libpng"
brew "libtiff"
brew "openexr"
brew "webp"
brew "jpeg-xl"
brew "libvmaf"
brew "aom"
brew "assimp"
brew "ca-certificates"
brew "gdbm"
brew "mpdecimal"
brew "openssl@1.1"
brew "readline"
brew "sqlite"
brew "xz"
brew "python@3.9"
brew "python-tabulate"
brew "six"
brew "athenacli"
brew "m4"
brew "autoconf"
brew "automake"
brew "hidapi"
brew "libelf"
brew "libusb"
brew "libusb-compat"
brew "libftdi0"
brew "libhid"
brew "avrdude"
brew "awscli"
brew "bdw-gc"
brew "berkeley-db"
brew "bootloadhid"
brew "c-ares"
brew "freetype"
brew "fontconfig"
brew "gettext"
brew "libffi"
brew "pcre"
brew "glib"
brew "pkg-config"
brew "libpthread-stubs"
brew "xorgproto"
brew "libxau"
brew "libxdmcp"
brew "libxcb"
brew "libx11"
brew "libxext"
brew "libxrender"
brew "lzo"
brew "pixman"
brew "cairo"
brew "openjdk@11"
brew "python@3.10"
brew "cassandra"
brew "cfitsio"
brew "cgif"
brew "clang-format"
brew "colordiff"
brew "gmp"
brew "coreutils"
brew "dbus"
brew "deno"
brew "go"
brew "dep"
brew "dfu-programmer"
brew "dfu-util"
brew "direnv"
brew "docbook"
brew "docbook-xsl"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "double-conversion"
brew "envchain"
brew "exa"
brew "fribidi"
brew "libtool"
brew "libunistring"
brew "guile"
brew "libevent"
brew "libidn2"
brew "libnghttp2"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "gobject-introspection"
brew "graphite2"
brew "icu4c"
brew "harfbuzz"
brew "little-cms2"
brew "openjpeg"
brew "libb2"
brew "lz4"
brew "zstd"
brew "libarchive"
brew "snappy"
brew "tesseract"
brew "x265"
brew "ffmpeg"
brew "isl"
brew "mpfr"
brew "libmpc"
brew "gcc"
brew "hwloc"
brew "open-mpi"
brew "fftw"
brew "ncurses"
brew "pcre2"
brew "fish"
brew "fzf"
brew "gdk-pixbuf"
brew "gh"
brew "jbig2dec"
brew "libidn"
brew "ghostscript"
brew "ghq"
brew "git"
brew "git-lfs"
brew "libgpg-error"
brew "libgcrypt"
brew "gmime"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnu-time"
brew "goenv"
brew "golang-migrate"
brew "golangci-lint"
brew "goreleaser"
brew "gradle"
brew "grep"
brew "libaec"
brew "hdf5"
brew "helm"
brew "htop"
brew "hub"
brew "hunspell"
brew "jasper"
brew "libde265"
brew "xmlto"
brew "shared-mime-info"
brew "libheif"
brew "liblqr"
brew "libomp"
brew "libraw"
brew "imagemagick"
brew "ipcalc"
brew "jemalloc"
brew "oniguruma"
brew "jq"
brew "krb5"
brew "kubernetes-cli"
brew "kustomize"
brew "libcbor"
brew "libev"
brew "libexif"
brew "libfido2"
brew "libgsf"
brew "libiconv"
brew "libimagequant"
brew "libmagic"
brew "libmatio"
brew "libmng"
brew "libraqm"
brew "lzlib"
brew "librdkafka"
brew "pango"
brew "librsvg"
brew "libslirp"
brew "libspng"
brew "libssh"
brew "libxml2"
brew "libxslt"
brew "libyaml"
brew "vde"
brew "qemu"
brew "lima"
brew "lmdb"
brew "lua"
brew "make"
brew "maven"
brew "md4c"
brew "minikube"
brew "mozjpeg"
brew "protobuf"
brew "mysql"
brew "mysql-client"
brew "neomutt"
brew "nghttp2"
brew "node-build"
brew "nodenv"
brew "nspr"
brew "nss"
brew "openslide"
brew "openssl@3"
brew "orc"
brew "parallel"
brew "percona-toolkit"
brew "tcl-tk"
brew "pillow"
brew "podman"
brew "qt"
brew "poppler"
brew "popt"
brew "postgresql"
brew "pssh"
brew "pyenv"
brew "ruby-build"
brew "rbenv"
brew "redis"
brew "ripgrep"
brew "rpm"
brew "shellcheck"
brew "stern"
brew "teensy_loader_cli"
brew "tfenv"
brew "tflint"
brew "tig"
brew "utf8proc"
brew "tmux"
brew "vips"
brew "watch"
brew "wget"
brew "yajl"
brew "yj"
brew "zlib"
brew "zoxide"
brew "zsh"
brew "sd"
brew "zsh-history-substring-search"
brew "aws/tap/aws-sam-cli"
brew "buildpacks/tap/pack"
brew "fujiwara/tap/lambroll"
brew "fujiwara/tap/tracer"
brew "hashicorp/tap/packer"
brew "k1loW/tap/ndiag"
brew "k1loW/tap/tbls"
brew "knqyf263/utern/utern"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "mrtc0/openv/openv"
brew "osx-cross/arm/arm-gcc-bin@8"
brew "osx-cross/avr/avr-binutils"
brew "osx-cross/avr/avr-gcc@8"
brew "qmk/qmk/mdloader"
brew "qmk/qmk/qmk"
brew "sachaos/todoist/todoist"
brew "takaishi/fomulas/csv2tbl"
brew "yq"
brew "mas"

cask "gpg-suite"
cask "font-ricty-diminished"
cask "1password-cli"
cask "alacritty"
cask "alt-tab"
cask "ngrok"
cask "sequel-ace"
cask "discord"
cask "zoom"
cask "obsidian"
cask "visual-studio-code"

mas "Evernote", id: 406056744
mas "GIPHY", id: 668208984
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Todoist", id: 585829637
mas "ToyViewer", id: 414298354
mas "Yoink", id: 457622435
mas "iMovie", id: 408981434
mas "Habitify", id: 1111447047
mas "MeetingBar", id: 1532419400
mas "Tot", id: 1491071483

